# DWFImportOptions Constructor (IList(ElementId))

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFImportOptions Constructor (IList<(Of <(<'ElementId>)>)>)
DWFImportOptions Class See Also
---
Constructs a new instance of DWFImportOptions with an array of imported sheet views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DWFImportOptions(
	IList<ElementId> views
)
```

Visual Basic
---
```text
Public Sub New ( _
	views As IList(Of ElementId) _
)
```

Visual C++
---
```text
public:
DWFImportOptions(
	IList<ElementId^>^ views
)
```

# ### Parameters
views
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)> These sheet views where DWF markups are imported.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DWFImportOptions Class
DWFImportOptions Overload
Autodesk.Revit.DB Namespace